Revit 2026 API

# FileImportingEventArgs Class

---

The event arguments used by the FileImporting event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.DB.EventsFileImportingEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FileImportingEventArgs : RevitAPIPreDocEventArgs
```
```vb
Public Class FileImportingEventArgs
	Inherits RevitAPIPreDocEventArgs
```
```cpp
public ref class FileImportingEventArgs : public RevitAPIPreDocEventArgs
```
```fsharp
type FileImportingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
```

The FileImportingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | Format | Identifies the import format, e.g. DWG or image. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | Path of the source file which is about to be imported. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace